[{"items": [{"tags": ["tensorflow", "gradienttape"], "owner": {"account_id": 15155295, "reputation": 31, "user_id": 10936313, "user_type": "registered", "profile_image": "https://lh6.googleusercontent.com/-rAbFF5dFW0Y/AAAAAAAAAAI/AAAAAAAAAAA/9pSR2Ij10Gw/photo.jpg?sz=256", "display_name": "Pravin Girase", "link": "https://stackoverflow.com/users/10936313/pravin-girase"}, "is_answered": true, "view_count": 605, "answer_count": 2, "score": 3, "last_activity_date": 1631867774, "creation_date": 1609220106, "last_edit_date": 1609269340, "question_id": 65487717, "content_license": "CC BY-SA 4.0", "link": "https://stackoverflow.com/questions/65487717/how-to-make-use-of-class-weights-to-calculated-custom-loss-fuction-while-using-c", "title": "How to make use of class_weights to calculated custom loss fuction while using custom training loop (i.e. not using .fit )", "body": "<p>I have written my custom training loop using <code>tf.GradientTape()</code>. My data has 2 classes. The classes are not balanced; <code>class1</code> data contributes almost 80% and <code>class2</code> contributes remaining 20%. Therefore in order to remove this imbalance I was trying to write custom loss function which will take into account this imbalance and apply the corresponding class weights and calculate the loss. i.e. I want to use the <code>class_weights = [0.2, 0.8]</code>. I am not able to find similar examples.</p>\n<p>However all the examples I am seeing are using model.fit approach where its easier to pass the <code>class_weights</code>. I am not able to find out the example which uses <code>class_weights</code> with custom training loop using <code>tf.GradientTape</code>.</p>\n<p>I did go through the suggestions of using <code>sample_weight</code>, however I don't have the data where in I can specify the weights for samples, therefore my preference is to use class weight.</p>\n<p>I am using <code>BinaryCrossentropy</code> loss as loss function but I want to change the loss based on the <code>class_weights</code>. That's where I am stuck, how to tell <code>BinaryCrossentropy</code> to consider the <code>class_weights</code>.</p>\n<p>Is my approach of using custom loss function correct or there is better way to make use of <code>class_weights</code> while training with custom training loop (not using <code>model.fit</code>)?</p>\n"}], "has_more": false, "quota_max": 300, "quota_remaining": 31}]